{
	"ok": true,
	"author": {
		"email": "email@luc.gg",
		"name": "Luc Boettner"
	},
	"frontend": {
		"url": "https://vast-taiga-86318.herokuapp.com/"
	},
	"language": "node.js (ts)",
	"sources": {
		"backend": "https://github.com/LucHighwalker/ava_colab",
		"frontend": "https://github.com/LucHighwalker/ava_frontend"
	},
	"answers": {
		"1": "I started off creating the backend. Getting most of the functionality of the backend working, before even starting the frontend.\nIt was a perfect opportunity to test out my personal tool \"jamf\" to generate some of the backend code (it still needs a lot of work).\nI'm a fan of typescript, and that's what jamf generates. So that lead me to also wanting to write the frontend in typescript. I'm very familiar writing angular frontends in typescript, but you guys mentioned you prefer react. So react in typescript it was, which was a first for me.\nI also wanted to try making my own highlighting text rather than using an available module.\nOh and Docker because Docker is cool!",
		"2": "Improving the conflict resolution would be first on my list. My implementation is fairly simple. I would also want to add authentication, rather than just asking for a name and being able to do whatever with it. I would also definitely style it more. Admittedly, styling is definitely not my strong suit, and I prioritized getting everything to function much more than the looks. I also attempted to make the name of the last mutation's author with the highlight (like on a google dock). That would definitely be something I would attempt again given more time.\nIn hindsight, I kind of regret spending so much time making my own text highlighter versus spending more time improving the conflict resolution or styling.",
		"3": "I thought using a serverless framework is kind of an odd stretch challenge for a fullstack position, since that's much more frontened oriented in my opinion. Otherwise I really enjoyed this challenge, it was definitely one of the more interesting coding challenges, and one I will probably continue working on on my spare time."
	}
}
